Public Attributes | List of all members
API_OpeningCoverFillsParameters Struct Reference
Element Manager API
Opening cover fills parameters. More...
#include <APIdefs_Elements.h>
 Public Attributes
bool  | useCoverFills
Use cover fills.
bool  | useFillsOfCutElements
Use fills of cut elements.
API_AttributeIndex  | coverFillIndex
Cover fill index.
short  | coverFillPenIndex
Cover fill pen index.
short  | coverFillBackgroundPenIndex
Cover fill background pen index.
API_HatchOrientationTypeID  | coverFillOrientation
Cover fill orientation (API_HatchGlobal, API_HatchRotated, API_HatchDistorted).
Detailed Description
Opening cover fills parameters.
Member Data Documentation
◆ coverFillBackgroundPenIndex
 API_OpeningCoverFillsParameters::coverFillBackgroundPenIndex
Cover fill background pen index.
◆ coverFillIndex
 API_OpeningCoverFillsParameters::coverFillIndex
Cover fill index.
◆ coverFillOrientation
 API_OpeningCoverFillsParameters::coverFillOrientation
Cover fill orientation (API_HatchGlobal, API_HatchRotated, API_HatchDistorted).
◆ coverFillPenIndex
 API_OpeningCoverFillsParameters::coverFillPenIndex
Cover fill pen index.
◆ useCoverFills
 API_OpeningCoverFillsParameters::useCoverFills
Use cover fills.
◆ useFillsOfCutElements
 API_OpeningCoverFillsParameters::useFillsOfCutElements
Use fills of cut elements.